RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/pds_reg.h
/**
  ******************************************************************************
  * @file    pds_reg.h
  * @version V1.2
  * @date    2020-04-30
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __PDS_REG_H__
#define __PDS_REG_H__

#include "bl602.h"

/* 0x0 : PDS_CTL */
#define PDS_CTL_OFFSET                   (0x0)
#define PDS_START_PS                     PDS_START_PS
#define PDS_START_PS_POS                 (0U)
#define PDS_START_PS_LEN                 (1U)
#define PDS_START_PS_MSK                 (((1U << PDS_START_PS_LEN) - 1) << PDS_START_PS_POS)
#define PDS_START_PS_UMSK                (~(((1U << PDS_START_PS_LEN) - 1) << PDS_START_PS_POS))
#define PDS_CR_SLEEP_FOREVER             PDS_CR_SLEEP_FOREVER
#define PDS_CR_SLEEP_FOREVER_POS         (1U)
#define PDS_CR_SLEEP_FOREVER_LEN         (1U)
#define PDS_CR_SLEEP_FOREVER_MSK         (((1U << PDS_CR_SLEEP_FOREVER_LEN) - 1) << PDS_CR_SLEEP_FOREVER_POS)
#define PDS_CR_SLEEP_FOREVER_UMSK        (~(((1U << PDS_CR_SLEEP_FOREVER_LEN) - 1) << PDS_CR_SLEEP_FOREVER_POS))
#define PDS_CR_XTAL_FORCE_OFF            PDS_CR_XTAL_FORCE_OFF
#define PDS_CR_XTAL_FORCE_OFF_POS        (2U)
#define PDS_CR_XTAL_FORCE_OFF_LEN        (1U)
#define PDS_CR_XTAL_FORCE_OFF_MSK        (((1U << PDS_CR_XTAL_FORCE_OFF_LEN) - 1) << PDS_CR_XTAL_FORCE_OFF_POS)
#define PDS_CR_XTAL_FORCE_OFF_UMSK       (~(((1U << PDS_CR_XTAL_FORCE_OFF_LEN) - 1) << PDS_CR_XTAL_FORCE_OFF_POS))
#define PDS_CR_WIFI_PDS_SAVE_STATE       PDS_CR_WIFI_PDS_SAVE_STATE
#define PDS_CR_WIFI_PDS_SAVE_STATE_POS   (3U)
#define PDS_CR_WIFI_PDS_SAVE_STATE_LEN   (1U)
#define PDS_CR_WIFI_PDS_SAVE_STATE_MSK   (((1U << PDS_CR_WIFI_PDS_SAVE_STATE_LEN) - 1) << PDS_CR_WIFI_PDS_SAVE_STATE_POS)
#define PDS_CR_WIFI_PDS_SAVE_STATE_UMSK  (~(((1U << PDS_CR_WIFI_PDS_SAVE_STATE_LEN) - 1) << PDS_CR_WIFI_PDS_SAVE_STATE_POS))
#define PDS_CR_PDS_PD_DCDC18             PDS_CR_PDS_PD_DCDC18
#define PDS_CR_PDS_PD_DCDC18_POS         (4U)
#define PDS_CR_PDS_PD_DCDC18_LEN         (1U)
#define PDS_CR_PDS_PD_DCDC18_MSK         (((1U << PDS_CR_PDS_PD_DCDC18_LEN) - 1) << PDS_CR_PDS_PD_DCDC18_POS)
#define PDS_CR_PDS_PD_DCDC18_UMSK        (~(((1U << PDS_CR_PDS_PD_DCDC18_LEN) - 1) << PDS_CR_PDS_PD_DCDC18_POS))
#define PDS_CR_PDS_PD_BG_SYS             PDS_CR_PDS_PD_BG_SYS
#define PDS_CR_PDS_PD_BG_SYS_POS         (5U)
#define PDS_CR_PDS_PD_BG_SYS_LEN         (1U)
#define PDS_CR_PDS_PD_BG_SYS_MSK         (((1U << PDS_CR_PDS_PD_BG_SYS_LEN) - 1) << PDS_CR_PDS_PD_BG_SYS_POS)
#define PDS_CR_PDS_PD_BG_SYS_UMSK        (~(((1U << PDS_CR_PDS_PD_BG_SYS_LEN) - 1) << PDS_CR_PDS_PD_BG_SYS_POS))
#define PDS_CR_PDS_GATE_CLK              PDS_CR_PDS_GATE_CLK
#define PDS_CR_PDS_GATE_CLK_POS          (8U)
#define PDS_CR_PDS_GATE_CLK_LEN          (1U)
#define PDS_CR_PDS_GATE_CLK_MSK          (((1U << PDS_CR_PDS_GATE_CLK_LEN) - 1) << PDS_CR_PDS_GATE_CLK_POS)
#define PDS_CR_PDS_GATE_CLK_UMSK         (~(((1U << PDS_CR_PDS_GATE_CLK_LEN) - 1) << PDS_CR_PDS_GATE_CLK_POS))
#define PDS_CR_PDS_MEM_STBY              PDS_CR_PDS_MEM_STBY
#define PDS_CR_PDS_MEM_STBY_POS          (9U)
#define PDS_CR_PDS_MEM_STBY_LEN          (1U)
#define PDS_CR_PDS_MEM_STBY_MSK          (((1U << PDS_CR_PDS_MEM_STBY_LEN) - 1) << PDS_CR_PDS_MEM_STBY_POS)
#define PDS_CR_PDS_MEM_STBY_UMSK         (~(((1U << PDS_CR_PDS_MEM_STBY_LEN) - 1) << PDS_CR_PDS_MEM_STBY_POS))
#define PDS_CR_PDS_ISO_EN                PDS_CR_PDS_ISO_EN
#define PDS_CR_PDS_ISO_EN_POS            (11U)
#define PDS_CR_PDS_ISO_EN_LEN            (1U)
#define PDS_CR_PDS_ISO_EN_MSK            (((1U << PDS_CR_PDS_ISO_EN_LEN) - 1) << PDS_CR_PDS_ISO_EN_POS)
#define PDS_CR_PDS_ISO_EN_UMSK           (~(((1U << PDS_CR_PDS_ISO_EN_LEN) - 1) << PDS_CR_PDS_ISO_EN_POS))
#define PDS_CR_PDS_WAIT_XTAL_RDY         PDS_CR_PDS_WAIT_XTAL_RDY
#define PDS_CR_PDS_WAIT_XTAL_RDY_POS     (12U)
#define PDS_CR_PDS_WAIT_XTAL_RDY_LEN     (1U)
#define PDS_CR_PDS_WAIT_XTAL_RDY_MSK     (((1U << PDS_CR_PDS_WAIT_XTAL_RDY_LEN) - 1) << PDS_CR_PDS_WAIT_XTAL_RDY_POS)
#define PDS_CR_PDS_WAIT_XTAL_RDY_UMSK    (~(((1U << PDS_CR_PDS_WAIT_XTAL_RDY_LEN) - 1) << PDS_CR_PDS_WAIT_XTAL_RDY_POS))
#define PDS_CR_PDS_PWR_OFF               PDS_CR_PDS_PWR_OFF
#define PDS_CR_PDS_PWR_OFF_POS           (13U)
#define PDS_CR_PDS_PWR_OFF_LEN           (1U)
#define PDS_CR_PDS_PWR_OFF_MSK           (((1U << PDS_CR_PDS_PWR_OFF_LEN) - 1) << PDS_CR_PDS_PWR_OFF_POS)
#define PDS_CR_PDS_PWR_OFF_UMSK          (~(((1U << PDS_CR_PDS_PWR_OFF_LEN) - 1) << PDS_CR_PDS_PWR_OFF_POS))
#define PDS_CR_PDS_PD_XTAL               PDS_CR_PDS_PD_XTAL
#define PDS_CR_PDS_PD_XTAL_POS           (14U)
#define PDS_CR_PDS_PD_XTAL_LEN           (1U)
#define PDS_CR_PDS_PD_XTAL_MSK           (((1U << PDS_CR_PDS_PD_XTAL_LEN) - 1) << PDS_CR_PDS_PD_XTAL_POS)
#define PDS_CR_PDS_PD_XTAL_UMSK          (~(((1U << PDS_CR_PDS_PD_XTAL_LEN) - 1) << PDS_CR_PDS_PD_XTAL_POS))
#define PDS_CR_PDS_SOC_ENB_FORCE_ON      PDS_CR_PDS_SOC_ENB_FORCE_ON
#define PDS_CR_PDS_SOC_ENB_FORCE_ON_POS  (15U)
#define PDS_CR_PDS_SOC_ENB_FORCE_ON_LEN  (1U)
#define PDS_CR_PDS_SOC_ENB_FORCE_ON_MSK  (((1U << PDS_CR_PDS_SOC_ENB_FORCE_ON_LEN) - 1) << PDS_CR_PDS_SOC_ENB_FORCE_ON_POS)
#define PDS_CR_PDS_SOC_ENB_FORCE_ON_UMSK (~(((1U << PDS_CR_PDS_SOC_ENB_FORCE_ON_LEN) - 1) << PDS_CR_PDS_SOC_ENB_FORCE_ON_POS))
#define PDS_CR_PDS_RST_SOC_EN            PDS_CR_PDS_RST_SOC_EN
#define PDS_CR_PDS_RST_SOC_EN_POS        (16U)
#define PDS_CR_PDS_RST_SOC_EN_LEN        (1U)
#define PDS_CR_PDS_RST_SOC_EN_MSK        (((1U << PDS_CR_PDS_RST_SOC_EN_LEN) - 1) << PDS_CR_PDS_RST_SOC_EN_POS)
#define PDS_CR_PDS_RST_SOC_EN_UMSK       (~(((1U << PDS_CR_PDS_RST_SOC_EN_LEN) - 1) << PDS_CR_PDS_RST_SOC_EN_POS))
#define PDS_CR_PDS_RC32M_OFF_DIS         PDS_CR_PDS_RC32M_OFF_DIS
#define PDS_CR_PDS_RC32M_OFF_DIS_POS     (17U)
#define PDS_CR_PDS_RC32M_OFF_DIS_LEN     (1U)
#define PDS_CR_PDS_RC32M_OFF_DIS_MSK     (((1U << PDS_CR_PDS_RC32M_OFF_DIS_LEN) - 1) << PDS_CR_PDS_RC32M_OFF_DIS_POS)
#define PDS_CR_PDS_RC32M_OFF_DIS_UMSK    (~(((1U << PDS_CR_PDS_RC32M_OFF_DIS_LEN) - 1) << PDS_CR_PDS_RC32M_OFF_DIS_POS))
#define PDS_CR_PDS_LDO_VSEL_EN           PDS_CR_PDS_LDO_VSEL_EN
#define PDS_CR_PDS_LDO_VSEL_EN_POS       (18U)
#define PDS_CR_PDS_LDO_VSEL_EN_LEN       (1U)
#define PDS_CR_PDS_LDO_VSEL_EN_MSK       (((1U << PDS_CR_PDS_LDO_VSEL_EN_LEN) - 1) << PDS_CR_PDS_LDO_VSEL_EN_POS)
#define PDS_CR_PDS_LDO_VSEL_EN_UMSK      (~(((1U << PDS_CR_PDS_LDO_VSEL_EN_LEN) - 1) << PDS_CR_PDS_LDO_VSEL_EN_POS))
#define PDS_CR_NP_WFI_MASK               PDS_CR_NP_WFI_MASK
#define PDS_CR_NP_WFI_MASK_POS           (21U)
#define PDS_CR_NP_WFI_MASK_LEN           (1U)
#define PDS_CR_NP_WFI_MASK_MSK           (((1U << PDS_CR_NP_WFI_MASK_LEN) - 1) << PDS_CR_NP_WFI_MASK_POS)
#define PDS_CR_NP_WFI_MASK_UMSK          (~(((1U << PDS_CR_NP_WFI_MASK_LEN) - 1) << PDS_CR_NP_WFI_MASK_POS))
#define PDS_CR_PDS_PD_LDO11              PDS_CR_PDS_PD_LDO11
#define PDS_CR_PDS_PD_LDO11_POS          (22U)
#define PDS_CR_PDS_PD_LDO11_LEN          (1U)
#define PDS_CR_PDS_PD_LDO11_MSK          (((1U << PDS_CR_PDS_PD_LDO11_LEN) - 1) << PDS_CR_PDS_PD_LDO11_POS)
#define PDS_CR_PDS_PD_LDO11_UMSK         (~(((1U << PDS_CR_PDS_PD_LDO11_LEN) - 1) << PDS_CR_PDS_PD_LDO11_POS))
#define PDS_CR_PDS_LDO_VOL               PDS_CR_PDS_LDO_VOL
#define PDS_CR_PDS_LDO_VOL_POS           (24U)
#define PDS_CR_PDS_LDO_VOL_LEN           (4U)
#define PDS_CR_PDS_LDO_VOL_MSK           (((1U << PDS_CR_PDS_LDO_VOL_LEN) - 1) << PDS_CR_PDS_LDO_VOL_POS)
#define PDS_CR_PDS_LDO_VOL_UMSK          (~(((1U << PDS_CR_PDS_LDO_VOL_LEN) - 1) << PDS_CR_PDS_LDO_VOL_POS))
#define PDS_CR_PDS_CTRL_RF               PDS_CR_PDS_CTRL_RF
#define PDS_CR_PDS_CTRL_RF_POS           (28U)
#define PDS_CR_PDS_CTRL_RF_LEN           (2U)
#define PDS_CR_PDS_CTRL_RF_MSK           (((1U << PDS_CR_PDS_CTRL_RF_LEN) - 1) << PDS_CR_PDS_CTRL_RF_POS)
#define PDS_CR_PDS_CTRL_RF_UMSK          (~(((1U << PDS_CR_PDS_CTRL_RF_LEN) - 1) << PDS_CR_PDS_CTRL_RF_POS))
#define PDS_CR_PDS_CTRL_PLL              PDS_CR_PDS_CTRL_PLL
#define PDS_CR_PDS_CTRL_PLL_POS          (30U)
#define PDS_CR_PDS_CTRL_PLL_LEN          (2U)
#define PDS_CR_PDS_CTRL_PLL_MSK          (((1U << PDS_CR_PDS_CTRL_PLL_LEN) - 1) << PDS_CR_PDS_CTRL_PLL_POS)
#define PDS_CR_PDS_CTRL_PLL_UMSK         (~(((1U << PDS_CR_PDS_CTRL_PLL_LEN) - 1) << PDS_CR_PDS_CTRL_PLL_POS))

