RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/pds_reg.h
/* 0x410 : clkpll_fbdv */
#define PDS_CLKPLL_FBDV_OFFSET         (0x410)
#define PDS_CLKPLL_SEL_SAMPLE_CLK      PDS_CLKPLL_SEL_SAMPLE_CLK
#define PDS_CLKPLL_SEL_SAMPLE_CLK_POS  (0U)
#define PDS_CLKPLL_SEL_SAMPLE_CLK_LEN  (2U)
#define PDS_CLKPLL_SEL_SAMPLE_CLK_MSK  (((1U << PDS_CLKPLL_SEL_SAMPLE_CLK_LEN) - 1) << PDS_CLKPLL_SEL_SAMPLE_CLK_POS)
#define PDS_CLKPLL_SEL_SAMPLE_CLK_UMSK (~(((1U << PDS_CLKPLL_SEL_SAMPLE_CLK_LEN) - 1) << PDS_CLKPLL_SEL_SAMPLE_CLK_POS))
#define PDS_CLKPLL_SEL_FB_CLK          PDS_CLKPLL_SEL_FB_CLK
#define PDS_CLKPLL_SEL_FB_CLK_POS      (2U)
#define PDS_CLKPLL_SEL_FB_CLK_LEN      (2U)
#define PDS_CLKPLL_SEL_FB_CLK_MSK      (((1U << PDS_CLKPLL_SEL_FB_CLK_LEN) - 1) << PDS_CLKPLL_SEL_FB_CLK_POS)
#define PDS_CLKPLL_SEL_FB_CLK_UMSK     (~(((1U << PDS_CLKPLL_SEL_FB_CLK_LEN) - 1) << PDS_CLKPLL_SEL_FB_CLK_POS))

/* 0x414 : clkpll_vco */
#define PDS_CLKPLL_VCO_OFFSET     (0x414)
#define PDS_CLKPLL_VCO_SPEED      PDS_CLKPLL_VCO_SPEED
#define PDS_CLKPLL_VCO_SPEED_POS  (0U)
#define PDS_CLKPLL_VCO_SPEED_LEN  (3U)
#define PDS_CLKPLL_VCO_SPEED_MSK  (((1U << PDS_CLKPLL_VCO_SPEED_LEN) - 1) << PDS_CLKPLL_VCO_SPEED_POS)
#define PDS_CLKPLL_VCO_SPEED_UMSK (~(((1U << PDS_CLKPLL_VCO_SPEED_LEN) - 1) << PDS_CLKPLL_VCO_SPEED_POS))
#define PDS_CLKPLL_SHRTR          PDS_CLKPLL_SHRTR
#define PDS_CLKPLL_SHRTR_POS      (3U)
#define PDS_CLKPLL_SHRTR_LEN      (1U)
#define PDS_CLKPLL_SHRTR_MSK      (((1U << PDS_CLKPLL_SHRTR_LEN) - 1) << PDS_CLKPLL_SHRTR_POS)
#define PDS_CLKPLL_SHRTR_UMSK     (~(((1U << PDS_CLKPLL_SHRTR_LEN) - 1) << PDS_CLKPLL_SHRTR_POS))

/* 0x418 : clkpll_sdm */
#define PDS_CLKPLL_SDM_OFFSET      (0x418)
#define PDS_CLKPLL_SDMIN           PDS_CLKPLL_SDMIN
#define PDS_CLKPLL_SDMIN_POS       (0U)
#define PDS_CLKPLL_SDMIN_LEN       (24U)
#define PDS_CLKPLL_SDMIN_MSK       (((1U << PDS_CLKPLL_SDMIN_LEN) - 1) << PDS_CLKPLL_SDMIN_POS)
#define PDS_CLKPLL_SDMIN_UMSK      (~(((1U << PDS_CLKPLL_SDMIN_LEN) - 1) << PDS_CLKPLL_SDMIN_POS))
#define PDS_CLKPLL_DITHER_SEL      PDS_CLKPLL_DITHER_SEL
#define PDS_CLKPLL_DITHER_SEL_POS  (24U)
#define PDS_CLKPLL_DITHER_SEL_LEN  (2U)
#define PDS_CLKPLL_DITHER_SEL_MSK  (((1U << PDS_CLKPLL_DITHER_SEL_LEN) - 1) << PDS_CLKPLL_DITHER_SEL_POS)
#define PDS_CLKPLL_DITHER_SEL_UMSK (~(((1U << PDS_CLKPLL_DITHER_SEL_LEN) - 1) << PDS_CLKPLL_DITHER_SEL_POS))
#define PDS_CLKPLL_SDM_FLAG        PDS_CLKPLL_SDM_FLAG
#define PDS_CLKPLL_SDM_FLAG_POS    (28U)
#define PDS_CLKPLL_SDM_FLAG_LEN    (1U)
#define PDS_CLKPLL_SDM_FLAG_MSK    (((1U << PDS_CLKPLL_SDM_FLAG_LEN) - 1) << PDS_CLKPLL_SDM_FLAG_POS)
#define PDS_CLKPLL_SDM_FLAG_UMSK   (~(((1U << PDS_CLKPLL_SDM_FLAG_LEN) - 1) << PDS_CLKPLL_SDM_FLAG_POS))
#define PDS_CLKPLL_SDM_BYPASS      PDS_CLKPLL_SDM_BYPASS
#define PDS_CLKPLL_SDM_BYPASS_POS  (29U)
#define PDS_CLKPLL_SDM_BYPASS_LEN  (1U)
#define PDS_CLKPLL_SDM_BYPASS_MSK  (((1U << PDS_CLKPLL_SDM_BYPASS_LEN) - 1) << PDS_CLKPLL_SDM_BYPASS_POS)
#define PDS_CLKPLL_SDM_BYPASS_UMSK (~(((1U << PDS_CLKPLL_SDM_BYPASS_LEN) - 1) << PDS_CLKPLL_SDM_BYPASS_POS))

/* 0x41C : clkpll_output_en */
#define PDS_CLKPLL_OUTPUT_EN_OFFSET  (0x41C)
#define PDS_CLKPLL_EN_480M           PDS_CLKPLL_EN_480M
#define PDS_CLKPLL_EN_480M_POS       (0U)
#define PDS_CLKPLL_EN_480M_LEN       (1U)
#define PDS_CLKPLL_EN_480M_MSK       (((1U << PDS_CLKPLL_EN_480M_LEN) - 1) << PDS_CLKPLL_EN_480M_POS)
#define PDS_CLKPLL_EN_480M_UMSK      (~(((1U << PDS_CLKPLL_EN_480M_LEN) - 1) << PDS_CLKPLL_EN_480M_POS))
#define PDS_CLKPLL_EN_240M           PDS_CLKPLL_EN_240M
#define PDS_CLKPLL_EN_240M_POS       (1U)
#define PDS_CLKPLL_EN_240M_LEN       (1U)
#define PDS_CLKPLL_EN_240M_MSK       (((1U << PDS_CLKPLL_EN_240M_LEN) - 1) << PDS_CLKPLL_EN_240M_POS)
#define PDS_CLKPLL_EN_240M_UMSK      (~(((1U << PDS_CLKPLL_EN_240M_LEN) - 1) << PDS_CLKPLL_EN_240M_POS))
#define PDS_CLKPLL_EN_192M           PDS_CLKPLL_EN_192M
#define PDS_CLKPLL_EN_192M_POS       (2U)
#define PDS_CLKPLL_EN_192M_LEN       (1U)
#define PDS_CLKPLL_EN_192M_MSK       (((1U << PDS_CLKPLL_EN_192M_LEN) - 1) << PDS_CLKPLL_EN_192M_POS)
#define PDS_CLKPLL_EN_192M_UMSK      (~(((1U << PDS_CLKPLL_EN_192M_LEN) - 1) << PDS_CLKPLL_EN_192M_POS))
#define PDS_CLKPLL_EN_160M           PDS_CLKPLL_EN_160M
#define PDS_CLKPLL_EN_160M_POS       (3U)
#define PDS_CLKPLL_EN_160M_LEN       (1U)
#define PDS_CLKPLL_EN_160M_MSK       (((1U << PDS_CLKPLL_EN_160M_LEN) - 1) << PDS_CLKPLL_EN_160M_POS)
#define PDS_CLKPLL_EN_160M_UMSK      (~(((1U << PDS_CLKPLL_EN_160M_LEN) - 1) << PDS_CLKPLL_EN_160M_POS))
#define PDS_CLKPLL_EN_120M           PDS_CLKPLL_EN_120M
#define PDS_CLKPLL_EN_120M_POS       (4U)
#define PDS_CLKPLL_EN_120M_LEN       (1U)
#define PDS_CLKPLL_EN_120M_MSK       (((1U << PDS_CLKPLL_EN_120M_LEN) - 1) << PDS_CLKPLL_EN_120M_POS)
#define PDS_CLKPLL_EN_120M_UMSK      (~(((1U << PDS_CLKPLL_EN_120M_LEN) - 1) << PDS_CLKPLL_EN_120M_POS))
#define PDS_CLKPLL_EN_96M            PDS_CLKPLL_EN_96M
#define PDS_CLKPLL_EN_96M_POS        (5U)
#define PDS_CLKPLL_EN_96M_LEN        (1U)
#define PDS_CLKPLL_EN_96M_MSK        (((1U << PDS_CLKPLL_EN_96M_LEN) - 1) << PDS_CLKPLL_EN_96M_POS)
#define PDS_CLKPLL_EN_96M_UMSK       (~(((1U << PDS_CLKPLL_EN_96M_LEN) - 1) << PDS_CLKPLL_EN_96M_POS))
#define PDS_CLKPLL_EN_80M            PDS_CLKPLL_EN_80M
#define PDS_CLKPLL_EN_80M_POS        (6U)
#define PDS_CLKPLL_EN_80M_LEN        (1U)
#define PDS_CLKPLL_EN_80M_MSK        (((1U << PDS_CLKPLL_EN_80M_LEN) - 1) << PDS_CLKPLL_EN_80M_POS)
#define PDS_CLKPLL_EN_80M_UMSK       (~(((1U << PDS_CLKPLL_EN_80M_LEN) - 1) << PDS_CLKPLL_EN_80M_POS))
#define PDS_CLKPLL_EN_48M            PDS_CLKPLL_EN_48M
#define PDS_CLKPLL_EN_48M_POS        (7U)
#define PDS_CLKPLL_EN_48M_LEN        (1U)
#define PDS_CLKPLL_EN_48M_MSK        (((1U << PDS_CLKPLL_EN_48M_LEN) - 1) << PDS_CLKPLL_EN_48M_POS)
#define PDS_CLKPLL_EN_48M_UMSK       (~(((1U << PDS_CLKPLL_EN_48M_LEN) - 1) << PDS_CLKPLL_EN_48M_POS))
#define PDS_CLKPLL_EN_32M            PDS_CLKPLL_EN_32M
#define PDS_CLKPLL_EN_32M_POS        (8U)
#define PDS_CLKPLL_EN_32M_LEN        (1U)
#define PDS_CLKPLL_EN_32M_MSK        (((1U << PDS_CLKPLL_EN_32M_LEN) - 1) << PDS_CLKPLL_EN_32M_POS)
#define PDS_CLKPLL_EN_32M_UMSK       (~(((1U << PDS_CLKPLL_EN_32M_LEN) - 1) << PDS_CLKPLL_EN_32M_POS))
#define PDS_CLKPLL_EN_DIV2_480M      PDS_CLKPLL_EN_DIV2_480M
#define PDS_CLKPLL_EN_DIV2_480M_POS  (9U)
#define PDS_CLKPLL_EN_DIV2_480M_LEN  (1U)
#define PDS_CLKPLL_EN_DIV2_480M_MSK  (((1U << PDS_CLKPLL_EN_DIV2_480M_LEN) - 1) << PDS_CLKPLL_EN_DIV2_480M_POS)
#define PDS_CLKPLL_EN_DIV2_480M_UMSK (~(((1U << PDS_CLKPLL_EN_DIV2_480M_LEN) - 1) << PDS_CLKPLL_EN_DIV2_480M_POS))

struct pds_reg {
    /* 0x0 : PDS_CTL */
    union {
        struct
        {
            uint32_t pds_start_ps            : 1; /* [    0],        w1p,        0x0 */
            uint32_t cr_sleep_forever        : 1; /* [    1],        r/w,        0x0 */
            uint32_t cr_xtal_force_off       : 1; /* [    2],        r/w,        0x0 */
            uint32_t cr_wifi_pds_save_state  : 1; /* [    3],        r/w,        0x0 */
            uint32_t cr_pds_pd_dcdc18        : 1; /* [    4],        r/w,        0x0 */
            uint32_t cr_pds_pd_bg_sys        : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7            : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t cr_pds_gate_clk         : 1; /* [    8],        r/w,        0x1 */
            uint32_t cr_pds_mem_stby         : 1; /* [    9],        r/w,        0x1 */
            uint32_t reserved_10             : 1; /* [   10],       rsvd,        0x0 */
            uint32_t cr_pds_iso_en           : 1; /* [   11],        r/w,        0x1 */
            uint32_t cr_pds_wait_xtal_rdy    : 1; /* [   12],        r/w,        0x0 */
            uint32_t cr_pds_pwr_off          : 1; /* [   13],        r/w,        0x1 */
            uint32_t cr_pds_pd_xtal          : 1; /* [   14],        r/w,        0x1 */
            uint32_t cr_pds_soc_enb_force_on : 1; /* [   15],        r/w,        0x0 */
            uint32_t cr_pds_rst_soc_en       : 1; /* [   16],        r/w,        0x0 */
            uint32_t cr_pds_rc32m_off_dis    : 1; /* [   17],        r/w,        0x0 */
            uint32_t cr_pds_ldo_vsel_en      : 1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_20          : 2; /* [20:19],       rsvd,        0x0 */
            uint32_t cr_np_wfi_mask          : 1; /* [   21],        r/w,        0x0 */
            uint32_t cr_pds_pd_ldo11         : 1; /* [   22],        r/w,        0x0 */
            uint32_t reserved_23             : 1; /* [   23],       rsvd,        0x0 */
            uint32_t cr_pds_ldo_vol          : 4; /* [27:24],        r/w,        0xa */
            uint32_t cr_pds_ctrl_rf          : 2; /* [29:28],        r/w,        0x1 */
            uint32_t cr_pds_ctrl_pll         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } PDS_CTL;

