RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/pds_reg.h
    /* 0x4 : PDS_TIME1 */
    union {
        struct
        {
            uint32_t cr_sleep_duration : 32; /* [31: 0],        r/w,      0xca8 */
        } BF;
        uint32_t WORD;
    } PDS_TIME1;

    /* 0x8  reserved */
    uint8_t RESERVED0x8[4];

    /* 0xC : PDS_INT */
    union {
        struct
        {
            uint32_t ro_pds_wake_int          : 1;  /* [    0],          r,        0x0 */
            uint32_t ro_pds_irq_in            : 1;  /* [    1],          r,        0x0 */
            uint32_t ro_pds_rf_done_int       : 1;  /* [    2],          r,        0x0 */
            uint32_t ro_pds_pll_done_int      : 1;  /* [    3],          r,        0x0 */
            uint32_t reserved_4_7             : 4;  /* [ 7: 4],       rsvd,        0x0 */
            uint32_t cr_pds_wake_int_mask     : 1;  /* [    8],        r/w,        0x0 */
            uint32_t cr_pds_irq_in_dis        : 1;  /* [    9],        r/w,        0x0 */
            uint32_t cr_pds_rf_done_int_mask  : 1;  /* [   10],        r/w,        0x0 */
            uint32_t cr_pds_pll_done_int_mask : 1;  /* [   11],        r/w,        0x0 */
            uint32_t reserved_12_15           : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t cr_pds_int_clr           : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31           : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } PDS_INT;

    /* 0x10 : PDS_CTL2 */
    union {
        struct
        {
            uint32_t cr_pds_force_np_pwr_off  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1               : 1;  /* [    1],       rsvd,        0x0 */
            uint32_t cr_pds_force_wb_pwr_off  : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3               : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t cr_pds_force_np_iso_en   : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5               : 1;  /* [    5],       rsvd,        0x0 */
            uint32_t cr_pds_force_wb_iso_en   : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t cr_pds_force_np_pds_rst  : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9               : 1;  /* [    9],       rsvd,        0x0 */
            uint32_t cr_pds_force_wb_pds_rst  : 1;  /* [   10],        r/w,        0x0 */
            uint32_t reserved_11              : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t cr_pds_force_np_mem_stby : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13              : 1;  /* [   13],       rsvd,        0x0 */
            uint32_t cr_pds_force_wb_mem_stby : 1;  /* [   14],        r/w,        0x0 */
            uint32_t reserved_15              : 1;  /* [   15],       rsvd,        0x0 */
            uint32_t cr_pds_force_np_gate_clk : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17              : 1;  /* [   17],       rsvd,        0x0 */
            uint32_t cr_pds_force_wb_gate_clk : 1;  /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_31           : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } PDS_CTL2;

    /* 0x14 : PDS_CTL3 */
    union {
        struct
        {
            uint32_t reserved_0                 : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t cr_pds_force_misc_pwr_off  : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_3               : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t cr_pds_force_misc_iso_en   : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_6               : 2;  /* [ 6: 5],       rsvd,        0x0 */
            uint32_t cr_pds_force_misc_pds_rst  : 1;  /* [    7],        r/w,        0x0 */
            uint32_t reserved_8_9               : 2;  /* [ 9: 8],       rsvd,        0x0 */
            uint32_t cr_pds_force_misc_mem_stby : 1;  /* [   10],        r/w,        0x0 */
            uint32_t reserved_11_12             : 2;  /* [12:11],       rsvd,        0x0 */
            uint32_t cr_pds_force_misc_gate_clk : 1;  /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_23             : 10; /* [23:14],       rsvd,        0x0 */
            uint32_t cr_pds_np_iso_en           : 1;  /* [   24],        r/w,        0x1 */
            uint32_t reserved_25_26             : 2;  /* [26:25],       rsvd,        0x0 */
            uint32_t cr_pds_wb_iso_en           : 1;  /* [   27],        r/w,        0x1 */
            uint32_t reserved_28_29             : 2;  /* [29:28],       rsvd,        0x0 */
            uint32_t cr_pds_misc_iso_en         : 1;  /* [   30],        r/w,        0x1 */
            uint32_t reserved_31                : 1;  /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } PDS_CTL3;

    /* 0x18 : PDS_CTL4 */
    union {
        struct
        {
            uint32_t cr_pds_np_pwr_off    : 1; /* [    0],        r/w,        0x1 */
            uint32_t cr_pds_np_reset      : 1; /* [    1],        r/w,        0x1 */
            uint32_t cr_pds_np_mem_stby   : 1; /* [    2],        r/w,        0x1 */
            uint32_t cr_pds_np_gate_clk   : 1; /* [    3],        r/w,        0x1 */
            uint32_t reserved_4_11        : 8; /* [11: 4],       rsvd,        0x0 */
            uint32_t cr_pds_wb_pwr_off    : 1; /* [   12],        r/w,        0x1 */
            uint32_t cr_pds_wb_reset      : 1; /* [   13],        r/w,        0x1 */
            uint32_t cr_pds_wb_mem_stby   : 1; /* [   14],        r/w,        0x1 */
            uint32_t cr_pds_wb_gate_clk   : 1; /* [   15],        r/w,        0x1 */
            uint32_t reserved_16_23       : 8; /* [23:16],       rsvd,        0x0 */
            uint32_t cr_pds_misc_pwr_off  : 1; /* [   24],        r/w,        0x1 */
            uint32_t cr_pds_misc_reset    : 1; /* [   25],        r/w,        0x1 */
            uint32_t cr_pds_misc_mem_stby : 1; /* [   26],        r/w,        0x1 */
            uint32_t cr_pds_misc_gate_clk : 1; /* [   27],        r/w,        0x1 */
            uint32_t reserved_28_31       : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } PDS_CTL4;

    /* 0x1C : pds_stat */
    union {
        struct
        {
            uint32_t ro_pds_state     : 4;  /* [ 3: 0],          r,        0x0 */
            uint32_t reserved_4_7     : 4;  /* [ 7: 4],       rsvd,        0x0 */
            uint32_t ro_pds_rf_state  : 4;  /* [11: 8],          r,        0x0 */
            uint32_t reserved_12_15   : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t ro_pds_pll_state : 2;  /* [17:16],          r,        0x0 */
            uint32_t reserved_18_31   : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pds_stat;

    /* 0x20 : pds_ram1 */
    union {
        struct
        {
            uint32_t cr_np_sram_pwr : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31  : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pds_ram1;

    /* 0x24  reserved */
    uint8_t RESERVED0x24[732];

    /* 0x300 : rc32m_ctrl0 */
    union {
        struct
        {
            uint32_t rc32m_cal_done        : 1; /* [    0],          r,        0x0 */
            uint32_t rc32m_rdy             : 1; /* [    1],          r,        0x0 */
            uint32_t rc32m_cal_inprogress  : 1; /* [    2],          r,        0x0 */
            uint32_t rc32m_cal_div         : 2; /* [ 4: 3],        r/w,        0x3 */
            uint32_t rc32m_cal_precharge   : 1; /* [    5],          r,        0x0 */
            uint32_t rc32m_dig_code_fr_cal : 8; /* [13: 6],          r,        0x0 */
            uint32_t reserved_14_16        : 3; /* [16:14],       rsvd,        0x0 */
            uint32_t rc32m_allow_cal       : 1; /* [   17],        r/w,        0x0 */
            uint32_t rc32m_refclk_half     : 1; /* [   18],        r/w,        0x0 */
            uint32_t rc32m_ext_code_en     : 1; /* [   19],        r/w,        0x1 */
            uint32_t rc32m_cal_en          : 1; /* [   20],        r/w,        0x0 */
            uint32_t rc32m_pd              : 1; /* [   21],        r/w,        0x0 */
            uint32_t rc32m_code_fr_ext     : 8; /* [29:22],        r/w,       0x60 */
            uint32_t reserved_30_31        : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rc32m_ctrl0;

