RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/pds_reg.h
    /* 0x304 : rc32m_ctrl1 */
    union {
        struct
        {
            uint32_t rc32m_test_en      : 1;  /* [    0],        r/w,        0x0 */
            uint32_t rc32m_soft_rst     : 1;  /* [    1],        r/w,        0x0 */
            uint32_t rc32m_clk_soft_rst : 1;  /* [    2],        r/w,        0x0 */
            uint32_t rc32m_clk_inv      : 1;  /* [    3],        r/w,        0x0 */
            uint32_t rc32m_clk_force_on : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_23      : 19; /* [23: 5],       rsvd,        0x0 */
            uint32_t rc32m_reserved     : 8;  /* [31:24],        r/w,        0xf */
        } BF;
        uint32_t WORD;
    } rc32m_ctrl1;

    /* 0x308  reserved */
    uint8_t RESERVED0x308[248];

    /* 0x400 : pu_rst_clkpll */
    union {
        struct
        {
            uint32_t clkpll_sdm_reset     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t clkpll_reset_postdiv : 1;  /* [    1],        r/w,        0x0 */
            uint32_t clkpll_reset_fbdv    : 1;  /* [    2],        r/w,        0x0 */
            uint32_t clkpll_reset_refdiv  : 1;  /* [    3],        r/w,        0x0 */
            uint32_t clkpll_pu_postdiv    : 1;  /* [    4],        r/w,        0x1 */
            uint32_t clkpll_pu_fbdv       : 1;  /* [    5],        r/w,        0x1 */
            uint32_t clkpll_pu_clamp_op   : 1;  /* [    6],        r/w,        0x1 */
            uint32_t clkpll_pu_pfd        : 1;  /* [    7],        r/w,        0x1 */
            uint32_t clkpll_pu_cp         : 1;  /* [    8],        r/w,        0x1 */
            uint32_t pu_clkpll_sfreg      : 1;  /* [    9],        r/w,        0x0 */
            uint32_t pu_clkpll            : 1;  /* [   10],        r/w,        0x0 */
            uint32_t reserved_11_31       : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pu_rst_clkpll;

    /* 0x404 : clkpll_top_ctrl */
    union {
        struct
        {
            uint32_t clkpll_postdiv        : 7; /* [ 6: 0],        r/w,       0x14 */
            uint32_t reserved_7            : 1; /* [    7],       rsvd,        0x0 */
            uint32_t clkpll_refdiv_ratio   : 4; /* [11: 8],        r/w,        0x4 */
            uint32_t clkpll_xtal_rc32m_sel : 1; /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15        : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t clkpll_refclk_sel     : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_19        : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t clkpll_vg11_sel       : 2; /* [21:20],        r/w,        0x1 */
            uint32_t reserved_22_23        : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t clkpll_vg13_sel       : 2; /* [25:24],        r/w,        0x1 */
            uint32_t reserved_26_31        : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } clkpll_top_ctrl;

    /* 0x408 : clkpll_cp */
    union {
        struct
        {
            uint32_t clkpll_sel_cp_bias   : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_3         : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t clkpll_icp_5u        : 2;  /* [ 5: 4],        r/w,        0x0 */
            uint32_t clkpll_icp_1u        : 2;  /* [ 7: 6],        r/w,        0x1 */
            uint32_t clkpll_int_frac_sw   : 1;  /* [    8],        r/w,        0x1 */
            uint32_t clkpll_cp_startup_en : 1;  /* [    9],        r/w,        0x1 */
            uint32_t clkpll_cp_opamp_en   : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31       : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } clkpll_cp;

    /* 0x40C : clkpll_rz */
    union {
        struct
        {
            uint32_t clkpll_c4_en    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3    : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t clkpll_r4       : 2;  /* [ 5: 4],        r/w,        0x2 */
            uint32_t reserved_6_7    : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t clkpll_r4_short : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_11   : 3;  /* [11: 9],       rsvd,        0x0 */
            uint32_t clkpll_c3       : 2;  /* [13:12],        r/w,        0x2 */
            uint32_t clkpll_cz       : 2;  /* [15:14],        r/w,        0x2 */
            uint32_t clkpll_rz       : 3;  /* [18:16],        r/w,        0x5 */
            uint32_t reserved_19_31  : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } clkpll_rz;

    /* 0x410 : clkpll_fbdv */
    union {
        struct
        {
            uint32_t clkpll_sel_sample_clk : 2;  /* [ 1: 0],        r/w,        0x1 */
            uint32_t clkpll_sel_fb_clk     : 2;  /* [ 3: 2],        r/w,        0x1 */
            uint32_t reserved_4_31         : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } clkpll_fbdv;

    /* 0x414 : clkpll_vco */
    union {
        struct
        {
            uint32_t clkpll_vco_speed : 3;  /* [ 2: 0],        r/w,        0x7 */
            uint32_t clkpll_shrtr     : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_31    : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } clkpll_vco;

    /* 0x418 : clkpll_sdm */
    union {
        struct
        {
            uint32_t clkpll_sdmin      : 24; /* [23: 0],        r/w,   0x600000 */
            uint32_t clkpll_dither_sel : 2;  /* [25:24],        r/w,        0x0 */
            uint32_t reserved_26_27    : 2;  /* [27:26],       rsvd,        0x0 */
            uint32_t clkpll_sdm_flag   : 1;  /* [   28],        r/w,        0x1 */
            uint32_t clkpll_sdm_bypass : 1;  /* [   29],        r/w,        0x0 */
            uint32_t reserved_30_31    : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } clkpll_sdm;

    /* 0x41C : clkpll_output_en */
    union {
        struct
        {
            uint32_t clkpll_en_480m      : 1;  /* [    0],        r/w,        0x0 */
            uint32_t clkpll_en_240m      : 1;  /* [    1],        r/w,        0x0 */
            uint32_t clkpll_en_192m      : 1;  /* [    2],        r/w,        0x0 */
            uint32_t clkpll_en_160m      : 1;  /* [    3],        r/w,        0x0 */
            uint32_t clkpll_en_120m      : 1;  /* [    4],        r/w,        0x0 */
            uint32_t clkpll_en_96m       : 1;  /* [    5],        r/w,        0x0 */
            uint32_t clkpll_en_80m       : 1;  /* [    6],        r/w,        0x0 */
            uint32_t clkpll_en_48m       : 1;  /* [    7],        r/w,        0x0 */
            uint32_t clkpll_en_32m       : 1;  /* [    8],        r/w,        0x1 */
            uint32_t clkpll_en_div2_480m : 1;  /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_31      : 22; /* [31:10],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } clkpll_output_en;
};

typedef volatile struct pds_reg pds_reg_t;

#endif /* __PDS_REG_H__ */
